notes/dec11/dec11.org
#+html_head: <link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>
#+html_head: <script src="../../jquery.min.js"></script>
#+html_head: <script src="../../bootstrap.min.js"></script>
#+html_head: <script type="text/javascript" src="../../readtheorg.js"></script>

#+Author: Julian Grove
#+Title: Rational Speech Act models via theorem proving

* Overview
  We have now shown how typed Î»-calculus, equipped with a DSL for characterizing
  probabilistic programs, can be implemented in Haskell and given an
  interpretation in which probabilistic reasoning is carried out using a theorem
  prover. One consequence of our system is that we can encode probabilistic
  programs characterizing models of inference and pragmatic reasoning; that is,
  by having a type $u$ of utterances and a type $i$ of possible worlds. This set
  of notes shows how our system may be used to implement one particular
  framework for Bayesian models of pragmatics---the [[http://www.problang.org/chapters/01-introduction.html][Rational Speech Act]] (RSA)
  framework.

* The Rational Speech Act framework
  Here I describe what is sometimes called /vanilla/ RSA. Vanilla RSA (yum) is RSA
  more or less as it was originally formulated [[https://web.stanford.edu/~ngoodman/papers/FrankGoodman-Science2012.pdf][here]]. The basic idea is that
  there are two sets of models, /listener/ models, and /speaker/ models, which are
  kind of mirror images of each other.

  In particular, any given listener model $L_i$ characterizes a probability
  distribution over possible worlds $w$, given some utterance $u$.
  $$\begin{aligned}
  P_{L_0}(w | u) &= \frac{\begin{cases}
  P_{L_0}(w) & âŸ¦uâŸ§^w = \mathtt{T} \\
  0 & âŸ¦uâŸ§^w = \mathtt{F}
  \end{cases}}{âˆ‘_{w^\prime}\begin{cases}
  P_{L_0}(w^\prime) & âŸ¦uâŸ§^{w^\prime} = \mathtt{T} \\
  0 & âŸ¦uâŸ§^{w^\prime} = \mathtt{F}
  \end{cases}} \\[2mm]
  P_{L_i}(w | u) &= \frac{P_{L_i}(u | w) * P_{L_i}(w)}{âˆ‘_{w^\prime}P_{L_i}(u | w^\prime) *
  P_{L_i}(w^\prime)}\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,(i > 0) \\[2mm]
  & = \frac{P_{L_i}(u | w) * P_{L_i}(w)}{P_{L_i}(u)}
  \end{aligned}$$
  In words, $P_{L_0}(w | u)$ depends only on whether or not $u$ and $w$ are
  compatible. It thus acts as a /filter/, eliminating possible worlds from the
  prior in which the utterance $u$ is false.

  The definition of $P_{L_i}(w | u)$ for $i > 0$ uses [[https://en.wikipedia.org/wiki/Bayes%27_theorem][Bayes' theorem]]. To state
  that this definition /uses/ Bayes' theorem is kind of a tautology when viewed
  simply as a mathematical description. Thus what this statement really means is
  something more operational: RSA models make distinguishing choices about the
  definitions of $P_{L_i}(u | w)$ and $P_{L_i}(w)$, and it is these latter
  choices which are used, in turn, to compute $P_{L_i}(w | u)$.
  
  In general, the choice $P_{L_i}(w)$ of a prior distribution over $w$ is made
  once and for all, regardless of the particular model, so we can just call this
  choice $P(w)$. $P(w)$ can be seen to give a representation of the /context set/
  in a given discourse; that is, the distribution over possible worlds known in
  common among the interlocutors, before anything is uttered.

  The definition of $P_{L_i}(u | w)$, on the other hand, is chosen to reflect
  the model $S_i$ of the /speaker/, which brings us to the /other/ set of
  models. Thus $P_{L_i}(u | w) = P_{S_i}(u | w)$, where
  $$\begin{aligned}
  P_{S_i}(u | w) &= \frac{e^{Î± * ð•Œ_{S_i}(u; w)}}{âˆ‘_{u^\prime}e^{Î± *
  ð•Œ_{S_i}(u^\prime; w)}}
  \end{aligned}$$
  $ð•Œ_{S_i}(u; w)$ is the /utility/ $S_i$ assigns to the utterance $u$, given its
  intention to communicate the world $w$. Utility for $S_i$ is typically defined
  as $$ð•Œ_{S_i}(u; w) = log(P_{L_{i-1}}(w | u)) - C(u)$$
  that is, the (natural) log of the probability that $L_{i-1}$ assigns to $w$
  (given $u$), minus \(u\)'s cost ($C(u)$). $Î±$ is known as the /temperature/
  (a.k.a. the  /rationality parameter/) associated with $S_i$. When $Î± = 0$, $S_i$
  chooses utterances randomly (from a uniform distribution), without attending
  to their utility in communicating $w$, while when $Î±$ tends toward $âˆž$, $S_i$
  becomes more and more deterministic in its choice of utterance, assigning more
  and more probability mass to the utterance that maximizes the utility in
  communicating $w$. Formally,
  $$\lim_{Î± â†’ âˆž}\frac{e^{Î± * ð•Œ_{S_i}(u; w)}}{âˆ‘_{u^\prime}e^{Î± *
  ð•Œ_{S_i}(u^\prime; w)}} = \begin{cases}
  1 & u = \arg\max_{u^\prime}(ð•Œ_{S_i}(u^\prime; w)) \\
  0 & u â‰  \arg\max_{u^\prime}(ð•Œ_{S_i}(u^\prime; w))
  \end{cases}$$
  Because the cost $C(u)$ only depends on $u$, it is nice to view $e^{Î± *
  ð•Œ_{S_i}(u; w)}$ as factored into a prior and a likelihood, so that
  $P_{S_i}(u | w)$ has a formulation symmetrical to that of $P_{L_i}(w | u)$
  (when $i > 0$); that is, it can be formulated in the following way:
  $$\begin{aligned}
  e^{Î± * ð•Œ_{S_i}(u; w)} &= P_{L_{i - 1}}(w | u)^Î± * \frac{1}{e^{Î± * C(u)}}
  \\[2mm] &âˆ P_{S_i}(w | u) * P_{S_i}(u) \\[2mm]
  &= P_{S_i}(w | u) * P(u)
  \end{aligned}$$
  In effect, we can define $P_{S_i}(w | u)$ to be proportional to $P_{L_{i -
  1}}(w | u)^Î±$; meanwhile, we can define $P(u)$, the prior probability over
  utterances, to be proportional to $\frac{1}{e^{Î± * C(u)}}$. (Note that if we
  ignore cost altogether, so that $C(u)$ is always, say, 0, then $P(u)$ just
  becomes a uniform distribution.)

  Taking these points into consideration, we may reformulate our speaker model,
  $S_i$, as follows:
  $$\begin{aligned}
  P_{S_i}(u | w) &= \frac{P_{S_i}(w | u) * P(u)}{âˆ‘_{u^\prime}P_{S_i}(w |
  u^\prime) * P(u^\prime)} \\[2mm]
  &= \frac{P_{S_i}(w | u) * P(u)}{P_{S_i}(w)}
  \end{aligned}$$
  In words, the speaker model, just like the listener model, may be viewed
  operationally in terms of Bayes' theorem. Note that $P_{S_i}(w)$, in general,
  defines a different distribution from $P(w)$, the listener's prior
  distribution over worlds (i.e., the context set). The former represents, not
  prior knowledge about the /context/, but rather something more like the relative
  "communicability" of a given possible world, given the distribution $P(u)$
  over utterances; that is, how likely a random utterance makes $w$, though with
  the exponential $Î±$ applied.

