notes/dec11/dec11.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-18 Mon 12:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rational Speech Act models via theorem proving</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Rational Speech Act models via theorem proving</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6690610">1. Overview</a></li>
<li><a href="#orge19c4fc">2. The Rational Speech Act framework</a></li>
<li><a href="#org656f3ba">3. Encoding RSA models in typed λ-calculus</a></li>
<li><a href="#orge8e70f6">4. Doing it all in Haskell</a>
<ul>
<li><a href="#org9d120f9">4.1. New constants</a></li>
<li><a href="#orgb8f84c7">4.2. New interpretations</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6690610" class="outline-2">
<h2 id="org6690610"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
We have now shown how typed λ-calculus, equipped with a DSL for characterizing
probabilistic programs, can be implemented in Haskell and given an
interpretation in which probabilistic reasoning is carried out using a theorem
prover. One consequence of our system is that we can encode probabilistic
programs characterizing models of inference and pragmatic reasoning; that is,
by having a type \(u\) of utterances and a type \(i\) of possible worlds. This set
of notes shows how our system may be used to implement one particular
framework for Bayesian models of pragmatics&#x2014;the <a href="http://www.problang.org/chapters/01-introduction.html">Rational Speech Act</a> (RSA)
framework.
</p>
</div>
</div>

<div id="outline-container-orge19c4fc" class="outline-2">
<h2 id="orge19c4fc"><span class="section-number-2">2.</span> The Rational Speech Act framework</h2>
<div class="outline-text-2" id="text-2">
<p>
Here I describe what is sometimes called <i>vanilla</i> RSA. Vanilla RSA (yum) is RSA
more or less as it was originally formulated <a href="https://web.stanford.edu/~ngoodman/papers/FrankGoodman-Science2012.pdf">here</a>. The basic idea is that
there are two sets of models, <i>listener</i> models, and <i>speaker</i> models, which are
kind of mirror images of each other.
</p>

<p>
In particular, any given listener model \(L_i\) characterizes a probability
distribution over possible worlds \(w\), given some utterance \(u\).
\[\begin{aligned}
  P_{L_0}(w | u) &= \frac{\begin{cases}
  P_{L_0}(w) & ⟦u⟧^w = \mathtt{T} \\
  0 & ⟦u⟧^w = \mathtt{F}
  \end{cases}}{∑_{w^\prime}\begin{cases}
  P_{L_0}(w^\prime) & ⟦u⟧^{w^\prime} = \mathtt{T} \\
  0 & ⟦u⟧^{w^\prime} = \mathtt{F}
  \end{cases}} \\[2mm]
  P_{L_i}(w | u) &= \frac{P_{L_i}(u | w) * P_{L_i}(w)}{∑_{w^\prime}P_{L_i}(u | w^\prime) *
  P_{L_i}(w^\prime)}\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,(i > 0) \\[2mm]
  & = \frac{P_{L_i}(u | w) * P_{L_i}(w)}{P_{L_i}(u)}
  \end{aligned}\]
In words, \(P_{L_0}(w | u)\) depends only on whether or not \(u\) and \(w\) are
compatible. It thus acts as a <i>filter</i>, eliminating possible worlds from the
prior in which the utterance \(u\) is false.
</p>

<p>
The definition of \(P_{L_i}(w | u)\) for \(i > 0\) uses <a href="https://en.wikipedia.org/wiki/Bayes%27_theorem">Bayes' theorem</a>. To state
that this definition <i>uses</i> Bayes' theorem is kind of a tautology when viewed
simply as a mathematical description. Thus what this statement really means is
something more operational: RSA models make distinguishing choices about the
definitions of \(P_{L_i}(u | w)\) and \(P_{L_i}(w)\), and it is these latter
choices which are used, in turn, to compute \(P_{L_i}(w | u)\).
</p>

<p>
In general, the choice \(P_{L_i}(w)\) of a prior distribution over \(w\) is made
once and for all, regardless of the particular model, so we can just call this
choice \(P(w)\). \(P(w)\) can be seen to give a representation of the <i>context set</i>
in a given discourse; that is, the distribution over possible worlds known in
common among the interlocutors, before anything is uttered.
</p>

<p>
The definition of \(P_{L_i}(u | w)\), on the other hand, is chosen to reflect
the model \(S_i\) of the <i>speaker</i>, which brings us to the <i>other</i> set of
models. Thus \(P_{L_i}(u | w) = P_{S_i}(u | w)\), where
\[\begin{aligned}
  P_{S_i}(u | w) &= \frac{e^{α * 𝕌_{S_i}(u; w)}}{∑_{u^\prime}e^{α *
  𝕌_{S_i}(u^\prime; w)}}
  \end{aligned}\]
\(𝕌_{S_i}(u; w)\) is the <i>utility</i> \(S_i\) assigns to the utterance \(u\), given its
intention to communicate the world \(w\). Utility for \(S_i\) is typically defined
as \[𝕌_{S_i}(u; w) = log(P_{L_{i-1}}(w | u)) - C(u)\]
that is, the (natural) log of the probability that \(L_{i-1}\) assigns to \(w\)
(given \(u\)), minus \(u\)'s cost (\(C(u)\)). \(α\) is known as the <i>temperature</i>
(a.k.a. the  <i>rationality parameter</i>) associated with \(S_i\). When \(α = 0\), \(S_i\)
chooses utterances randomly (from a uniform distribution), without attending
to their utility in communicating \(w\), while when \(α\) tends toward \(∞\), \(S_i\)
becomes more and more deterministic in its choice of utterance, assigning more
and more probability mass to the utterance that maximizes the utility in
communicating \(w\). Formally,
\[\lim_{α → ∞}\frac{e^{α * 𝕌_{S_i}(u; w)}}{∑_{u^\prime}e^{α *
  𝕌_{S_i}(u^\prime; w)}} = \begin{cases}
  1 & u = \arg\max_{u^\prime}(𝕌_{S_i}(u^\prime; w)) \\
  0 & u ≠ \arg\max_{u^\prime}(𝕌_{S_i}(u^\prime; w))
  \end{cases}\]
Because the cost \(C(u)\) only depends on \(u\), it is nice to view \(e^{α *
  𝕌_{S_i}(u; w)}\) as factored into a prior and a likelihood, so that
\(P_{S_i}(u | w)\) has a formulation symmetrical to that of \(P_{L_i}(w | u)\)
(when \(i > 0\)); that is, it can be formulated in the following way:
\[\begin{aligned}
  e^{α * 𝕌_{S_i}(u; w)} &= P_{L_{i - 1}}(w | u)^α * \frac{1}{e^{α * C(u)}}
  \\[2mm] &∝ P_{S_i}(w | u) * P_{S_i}(u) \\[2mm]
  &= P_{S_i}(w | u) * P(u)
  \end{aligned}\]
In effect, we can define \(P_{S_i}(w | u)\) to be proportional to \(P_{L_{i -
  1}}(w | u)^α\); meanwhile, we can define \(P(u)\), the prior probability over
utterances, to be proportional to \(\frac{1}{e^{α * C(u)}}\). (Note that if we
ignore cost altogether, so that \(C(u)\) is always, say, 0, then \(P(u)\) just
becomes a uniform distribution.)
</p>

<p>
Taking these points into consideration, we may reformulate our speaker model,
\(S_i\), as follows:
\[\begin{aligned}
  P_{S_i}(u | w) &= \frac{P_{S_i}(w | u) * P(u)}{∑_{u^\prime}P_{S_i}(w |
  u^\prime) * P(u^\prime)} \\[2mm]
  &= \frac{P_{S_i}(w | u) * P(u)}{P_{S_i}(w)}
  \end{aligned}\]
In words, the speaker model, just like the listener model, may be viewed
operationally in terms of Bayes' theorem. Note that \(P_{S_i}(w)\), in general,
defines a different distribution from \(P(w)\), the listener's prior
distribution over worlds (i.e., the context set). The former represents, not
prior knowledge about the <i>context</i>, but rather something more like the relative
"communicability" of a given possible world, given the distribution \(P(u)\)
over utterances; that is, how likely a random utterance makes \(w\), though with
the exponential \(α\) applied.
</p>
</div>
</div>
