notes/dec11/dec11.org
* Encoding RSA models in typed Î»-calculus
  Cool, so there's a way of regarding listener models and speaker models as
  symmetrical, in the sense that they both can be characterized operationally in
  terms of Bayes's theorem, but the positions of $w$ and the $u$ in the relevant
  equations are swapped. In summary, when $i > 0$,
  $$\begin{aligned}
  P_{L_i}(w | u) &= \frac{P_{L_i}(u | w) * P(w)}{P_{L_i}(u)} \\[2mm]
  P_{S_i}(u | w) &= \frac{P_{S_i}(w | u) * P(u)}{P_{S_i}(w)}
  \end{aligned}$$
  and when $i = 0$,
  $$P_{L_0}(w | u) = \frac{\begin{cases}
  P(w) & âŸ¦uâŸ§^w = \mathtt{T} \\
  0 & âŸ¦uâŸ§^w = \mathtt{F}
  \end{cases}}{âˆ‘_{w^\prime}\begin{cases}
  P(w^\prime) & âŸ¦uâŸ§^{w^\prime} = \mathtt{T} \\
  0 & âŸ¦uâŸ§^{w^\prime} = \mathtt{F}
  \end{cases}}$$
  Presenting RSA models this way provides insight into how they may be
  formulated type-theoretically. In particular, We can regard our listener and
  speaker models as /probabilistic programs/ with the following type signatures:
  $$\begin{aligned}
  L_{(Â·)} &: â„• â†’ u â†’ \mathtt{P} i \\[2mm]
  S_{(Â·)} &: â„• â†’ i â†’ \mathtt{P} u
  \end{aligned}$$
  That is, the listener model $L$ takes a natural number $i$ and an utterance
  $u$, and returns a probabilistic program that encodes the probability
  distribution $P_{L_i}(w | u)$. The speaker model $S$ takes a natural number
  $i$ and a possible world $w$, and returns a probabilistic program that encodes
  the probability distribution $P_{S_i}(u | w)$. The definitions of these models
  as probabilistic programs may then be given as
  $$\begin{aligned}
  L_0(u) &= \begin{array}[t]{l}
  w âˆ¼ \mathtt{context} \\
  observe(âŸ¦uâŸ§^w = \mathtt{T}) \\
  return(w)
  \end{array} \\[1cm]
  L_i(u) &= \begin{array}[t]{l}
  w âˆ¼ \mathtt{context} \\
  factor(P_{L_i}(u | w)) \\
  return(w)
  \end{array}\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,(i > 0) \\[2mm]
  &= \begin{array}[t]{l}
  w âˆ¼ \mathtt{context} \\
  factor(P_{S_i}(u | w)) \\
  return(w)
  \end{array} \\[1cm]
  S_i(w) &= \begin{array}[t]{l}
  u âˆ¼ \mathtt{utterances} \\
  factor(P_{S_i}(w | u)) \\
  return(u)
  \end{array}\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,(i > 0) \\[2mm]
  &= \begin{array}[t]{l}
  u âˆ¼ \mathtt{utterances} \\
  factor(P_{L_{i-1}}(w | u)^Î±) \\
  return(u)
  \end{array}
  \end{aligned}$$
  where $\mathtt{context}$ is the probabilistic program of type $\mathtt{P} i$
  representing the prior $P(w)$, and $\mathtt{utterances}$ is the probabilistic
  program of type $\mathtt{P} u$ representing the prior $P(u)$.

  The one big remaining question is how we go about computing probability /masses/
  and /densities/ of the kind represented by $P_{S_i}(u | w)$ and $P_{L_i}(w | u)$
  (for a given $i$). To do this, let's introduce one more constant into our DSL,
  which takes the /density function/ on \(Î±\)'s associated with a given
  probabilistic program whose values are of type $Î±$.
  $$D_{(Â·)} : \mathtt{P} Î± â†’ Î± â†’ r$$
  We will eventually have to give an interpretation to this constant, but let's
  not worry about that right now; let us just assume we have it. We may now
  formulate the recursive branches of our speaker and listener models as
  follows:
  $$\begin{aligned}
  S_i(w) &= \begin{array}[t]{l}
  u âˆ¼ \mathtt{utterances} \\
  factor(D_{L_{i-1}(u)}(w)^Î±) \\
  return(u)
  \end{array}\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,(i > 0) \\[1cm]
  L_i(u) &= \begin{array}[t]{l}
  w âˆ¼ \mathtt{context} \\
  factor(D_{S_i(w)}(u)) \\
  return(w)
  \end{array}\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,(i > 0)
  \end{aligned}$$
  We now have a full-blown typed implementation of (vanilla) RSA. Neat!
  
* Doing it all in Haskell
  The rest is kind of straightforward: we only need to add a constant (or
  constants, rather) to encode $D$, as well as a constant to encode $Î±$, along
  with constants representing the probabilistic programs that encode prior
  distributions over possible worlds and utterances, respectively.

  
