notes/dec11/dec11.html

<div id="outline-container-org656f3ba" class="outline-2">
<h2 id="org656f3ba"><span class="section-number-2">3.</span> Encoding RSA models in typed λ-calculus</h2>
<div class="outline-text-2" id="text-3">
<p>
Cool, so there's a way of regarding listener models and speaker models as
symmetrical, in the sense that they both can be characterized operationally in
terms of Bayes's theorem, but the positions of \(w\) and the \(u\) in the relevant
equations are swapped. In summary, when \(i > 0\),
\[\begin{aligned}
  P_{L_i}(w | u) &= \frac{P_{L_i}(u | w) * P(w)}{P_{L_i}(u)} \\[2mm]
  P_{S_i}(u | w) &= \frac{P_{S_i}(w | u) * P(u)}{P_{S_i}(w)}
  \end{aligned}\]
and when \(i = 0\),
\[P_{L_0}(w | u) = \frac{\begin{cases}
  P(w) & ⟦u⟧^w = \mathtt{T} \\
  0 & ⟦u⟧^w = \mathtt{F}
  \end{cases}}{∑_{w^\prime}\begin{cases}
  P(w^\prime) & ⟦u⟧^{w^\prime} = \mathtt{T} \\
  0 & ⟦u⟧^{w^\prime} = \mathtt{F}
  \end{cases}}\]
Presenting RSA models this way provides insight into how they may be
formulated type-theoretically. In particular, We can regard our listener and
speaker models as <i>probabilistic programs</i> with the following type signatures:
\[\begin{aligned}
  L_{(·)} &: ℕ → u → \mathtt{P} i \\[2mm]
  S_{(·)} &: ℕ → i → \mathtt{P} u
  \end{aligned}\]
That is, the listener model \(L\) takes a natural number \(i\) and an utterance
\(u\), and returns a probabilistic program that encodes the probability
distribution \(P_{L_i}(w | u)\). The speaker model \(S\) takes a natural number
\(i\) and a possible world \(w\), and returns a probabilistic program that encodes
the probability distribution \(P_{S_i}(u | w)\). The definitions of these models
as probabilistic programs may then be given as
\[\begin{aligned}
  L_0(u) &= \begin{array}[t]{l}
  w ∼ \mathtt{context} \\
  observe(⟦u⟧^w = \mathtt{T}) \\
  return(w)
  \end{array} \\[1cm]
  L_i(u) &= \begin{array}[t]{l}
  w ∼ \mathtt{context} \\
  factor(P_{L_i}(u | w)) \\
  return(w)
  \end{array}\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,(i > 0) \\[2mm]
  &= \begin{array}[t]{l}
  w ∼ \mathtt{context} \\
  factor(P_{S_i}(u | w)) \\
  return(w)
  \end{array} \\[1cm]
  S_i(w) &= \begin{array}[t]{l}
  u ∼ \mathtt{utterances} \\
  factor(P_{S_i}(w | u)) \\
  return(u)
  \end{array}\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,(i > 0) \\[2mm]
  &= \begin{array}[t]{l}
  u ∼ \mathtt{utterances} \\
  factor(P_{L_{i-1}}(w | u)^α) \\
  return(u)
  \end{array}
  \end{aligned}\]
where \(\mathtt{context}\) is the probabilistic program of type \(\mathtt{P} i\)
representing the prior \(P(w)\), and \(\mathtt{utterances}\) is the probabilistic
program of type \(\mathtt{P} u\) representing the prior \(P(u)\).
</p>

<p>
The one big remaining question is how we go about computing probability <i>masses</i>
and <i>densities</i> of the kind represented by \(P_{S_i}(u | w)\) and \(P_{L_i}(w | u)\)
(for a given \(i\)). To do this, let's introduce one more constant into our DSL,
which takes the <i>density function</i> on \(α\)'s associated with a given
probabilistic program whose values are of type \(α\).
\[D_{(·)} : \mathtt{P} α → α → r\]
We will eventually have to give an interpretation to this constant, but let's
not worry about that right now; let us just assume we have it. We may now
formulate the recursive branches of our speaker and listener models as
follows:
\[\begin{aligned}
  S_i(w) &= \begin{array}[t]{l}
  u ∼ \mathtt{utterances} \\
  factor(D_{L_{i-1}(u)}(w)^α) \\
  return(u)
  \end{array}\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,(i > 0) \\[1cm]
  L_i(u) &= \begin{array}[t]{l}
  w ∼ \mathtt{context} \\
  factor(D_{S_i(w)}(u)) \\
  return(w)
  \end{array}\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,\,(i > 0)
  \end{aligned}\]
We now have a full-blown typed implementation of (vanilla) RSA. Neat!
</p>
</div>
</div>

<div id="outline-container-orge8e70f6" class="outline-2">
<h2 id="orge8e70f6"><span class="section-number-2">4.</span> Doing it all in Haskell</h2>
<div class="outline-text-2" id="text-4">
<p>
The rest is kind of straightforward: we only need to add a constant (or
constants, rather) to encode \(D\), as well as a constant to encode \(α\), along
with constants representing the probabilistic programs that encode prior
distributions over possible worlds and utterances, respectively.
</p>
</div>
