notes/dec11/dec11.org
** New constants
   Note that in the models above, $D$ is only ever used to extract density
   functions of type $i â†’ r$ and type $u â†’ r$, so we really only need two
   constants in this case.
   #+begin_src haskell
     data Constant (Ï† :: Type) where
       ...
       DensityI :: Constant (P I :-> (I :-> R))
       DensityU :: Constant (P U :-> (U :-> R))
       ...
   #+end_src
   To encode $Î±$, we can add a constant which takes two real numbers and
   exponentiates the second one to the value of the first.
   #+begin_src haskell
     data Constant (Ï† :: Type) where
       ...
       Alpha :: Constant (R :-> (R :-> R))
       ...
   #+end_src
   Finally the constants representing possible world and utterance priors
   receive the types of probabilistic programs.
   #+begin_src haskell
     data Constant (Ï† :: Type) where
       ...
       Context :: Constant (P I)
       Utterances :: Constant (P U)
       ...
   #+end_src

   The listener and speaker models may now be encoded as follows:
   #+begin_src haskell
     l :: Integer -> Term Î³ (U :-> P I)
     l 0 = Lam (Let (Con Context) (Let (App (Con Factor) (App (Con Indi) (App (App (Con Interp) (Var (Next First))) (Var First)))) (Return (Var (Next First)))))
     l i = Lam (Let (Con Context) (Let (App (Con Factor) (App (App (Con DensityU) (App (s i) (Var First))) (Var (Next First)))) (Return (Var (Next First))))a

     s :: Integer -> Term Î³ (I :-> P U)
     s i = Lam (Let (Con Utterances) (Let (App (Con Factor) (App (App (Con Alpha) (Con (ToReal 4))) (App (App (Con DensityI) (App (l (i-1)) (Var First))) (Var (Next First))))) (Return (Var (Next First)))))
   #+end_src
   Note that we have chosen the speaker model's $Î±$ to be 4.

