notes/dec11/dec11.html


<div id="outline-container-org9d120f9" class="outline-3">
<h3 id="org9d120f9"><span class="section-number-3">4.1.</span> New constants</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Note that in the models above, \(D\) is only ever used to extract density
functions of type \(i → r\) and type \(u → r\), so we really only need two
constants in this case.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Constant</span> (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Type</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #83a598;">...</span>
  <span style="color: #d3869b;">DensityI</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">P</span> <span style="color: #d3869b;">I</span> <span style="color: #d3869b;">:-&gt;</span> (<span style="color: #d3869b;">I</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">R</span>))
  <span style="color: #d3869b;">DensityU</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">P</span> <span style="color: #d3869b;">U</span> <span style="color: #d3869b;">:-&gt;</span> (<span style="color: #d3869b;">U</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">R</span>))
  <span style="color: #83a598;">...</span>
</pre>
</div>
<p>
To encode \(α\), we can add a constant which takes two real numbers and
exponentiates the second one to the value of the first.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Constant</span> (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Type</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #83a598;">...</span>
  <span style="color: #d3869b;">Alpha</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">R</span> <span style="color: #d3869b;">:-&gt;</span> (<span style="color: #d3869b;">R</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">R</span>))
  <span style="color: #83a598;">...</span>
</pre>
</div>
<p>
Finally the constants representing possible world and utterance priors
receive the types of probabilistic programs.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Constant</span> (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Type</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #83a598;">...</span>
  <span style="color: #d3869b;">Context</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">P</span> <span style="color: #d3869b;">I</span>)
  <span style="color: #d3869b;">Utterances</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">P</span> <span style="color: #d3869b;">U</span>)
  <span style="color: #83a598;">...</span>
</pre>
</div>

<p>
The listener and speaker models may now be encoded as follows:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">l</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Integer</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> &#947; (<span style="color: #d3869b;">U</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">P</span> <span style="color: #d3869b;">I</span>)
<span style="color: #fabd2f;">l</span> 0 <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Let</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Context</span>) (<span style="color: #d3869b;">Let</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Factor</span>) (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Indi</span>) (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Interp</span>) (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>))) (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>)))) (<span style="color: #d3869b;">Return</span> (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>)))))
<span style="color: #fabd2f;">l</span> i <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Let</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Context</span>) (<span style="color: #d3869b;">Let</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Factor</span>) (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">DensityU</span>) (<span style="color: #d3869b;">App</span> (s i) (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>))) (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>)))) (<span style="color: #d3869b;">Return</span> (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>))))a

<span style="color: #fabd2f;">s</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Integer</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> &#947; (<span style="color: #d3869b;">I</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">P</span> <span style="color: #d3869b;">U</span>)
<span style="color: #fabd2f;">s</span> i <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Let</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Utterances</span>) (<span style="color: #d3869b;">Let</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Factor</span>) (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Alpha</span>) (<span style="color: #d3869b;">Con</span> (<span style="color: #d3869b;">ToReal</span> 4))) (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">DensityI</span>) (<span style="color: #d3869b;">App</span> (l (i<span style="color: #83a598;">-</span>1)) (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>))) (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>))))) (<span style="color: #d3869b;">Return</span> (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>)))))
</pre>
</div>
<p>
Note that we have chosen the speaker model's \(α\) to be 4.
</p>
</div>
</div>
