notes/dec11/dec11.org
** New interpretations   
   All that's left is to provide interpretations to the new constants, via
   ~interpCon~.
   #+begin_src haskell
     interpCon :: Integer -> Constant Ï† -> Domain Ï†
   #+end_src
   The most straightforward case is ~Alpha~, which we can interpret as
   #+begin_src haskell
     interpCon _ Alpha = \x y -> y ** x
   #+end_src
   Here, ~(**)~ is Haskell's function for exponentiation using the ~Double~ data
   type.

   Let's take care of the prior knowledge represented by ~Utterances~ and ~Context~.
   We can assume ~Utterances~ represents, say, a uniform distribution over three
   utterances.
   #+begin_src haskell
    interpCon _ Utterances = utterances
      where utterances :: ProbProg (Expr S)
	    utterances = categorical [0.33, 0.33, 0.33] [ everyoneSleeps
							, someoneSleeps
							, noOneSleeps ]
            categorical :: [Double] -> [a] -> ProbProg a
            categorical ws vs = PP (\f -> sum (zipWith (*) ws (map f vs)))
   #+end_src
   ~Context~ can be interpreted the same way ~WorldKnowedge~ was in [[../dec6/dec6.html][the last set of
   notes]].
   #+begin_src haskell
     interpCon _ Context = worldKnowledge
   #+end_src 

   Finally, let's interpret the constants that extract density functions from
   probabilistic programs.
   #+begin_src haskell
     interpCon _ DensityI = \m i -> expVal m (indicator . (mutualEntails 11 i))
       where mutualEntails :: Int -> [FOL.Form] -> [FOL.Form] -> Bool
	     mutualEntails n fs1 fs2 = all (entails n fs1) fs2 && all (entails n fs2) fs1

     interpCon _ DensityU = \m u -> expVal m (indicator . (== u))
   #+end_src
   In words, ~DensityI~ is interpreted as a function, of type ~ProbProg [FOL.Form]
   -> [FOL.Form] -> Double~; that is, which reads in a probabilistic program of
   type ~ProbProg [FOL.Form]~ and a possible world ~i~ (of type ~[FOL.Form]~), in
   order to take the probability that the program returns a possible world which
   is in a mutual entailment relationship with ~i~.

   The interpretation of ~DensityU~, which is of type ~ProbProg (Expr S) -> Expr S
   -> Double~, is similar; but it rather takes the probability that the relevant
   program returns the relevant input utterance ~u~. 

   That's it! If we want to test this out, we could, say, check the mass that ~l
   1~ assigns to some example possible world ~i0~, when it is applied to the
   utterance ~someoneSleeps~.
   #+begin_src haskell
   -- An example possible world
   i0 :: [FOL.Form]
   i0 = [sleep (FOL.N (FOL.Name 1)), FOL.Not (sleep (FOL.N (FOL.Name 0)))]
   #+end_src
   (~i0~ is the world where Julian (~FOL.N (FOL.Name 1)~) sleeps but Carina (~FOL.N
   (FOL.Name 0)~) doesn't.)
   #+begin_src haskell
     >>>  interpClosedTerm (App (Con DensityI) (App (l 1) (Con (ToUtt someoneSleeps)))) i0
     0.49696969696969695
   #+end_src
   Thus when the relevant utterance is /someone sleeps/, $L_1$ assigns about half
   the mass to the possible world in which one person sleeps and the other
   person doesn't. Indeed, close to all of the remaining mass will be assigned
   to the possible world in which the sleepers are switched; that is, in which
   Carina sleeps, but Julian doesn't. Close to no mass at all is assigned to the
   possible world in which both Julian and Carina sleep. Hence, we end up with
   something like a /quantity implicature/, due to the choice of a prior over
   utterances which includes the utterance /everyone sleeps/.
   
   You can check that the difference between the $L_0$ model and the $L_1$ model
   is effectively the presence of this implicature; the $L_0$ model just spits
   out the mass assigned by the prior probability over worlds to worlds in which
   at least one person sleeps, consistent with the literal meaning of the
   quantifier /some/.
