notes/dec11/dec11.html

<div id="outline-container-orgb8f84c7" class="outline-3">
<h3 id="orgb8f84c7"><span class="section-number-3">4.2.</span> New interpretations</h3>
<div class="outline-text-3" id="text-4-2">
<p>
All that's left is to provide interpretations to the new constants, via
<code>interpCon</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpCon</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Integer</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Constant</span> &#966; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Domain</span> &#966;
</pre>
</div>
<p>
The most straightforward case is <code>Alpha</code>, which we can interpret as
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">Alpha</span> <span style="color: #83a598;">=</span> <span style="color: #83a598;">\</span>x y <span style="color: #83a598;">-&gt;</span> y <span style="color: #83a598;">**</span> x
</pre>
</div>
<p>
Here, <code>(**)</code> is Haskell's function for exponentiation using the <code>Double</code> data
type.
</p>

<p>
Let's take care of the prior knowledge represented by <code>Utterances</code> and <code>Context</code>.
We can assume <code>Utterances</code> represents, say, a uniform distribution over three
utterances.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">Utterances</span> <span style="color: #83a598;">=</span> utterances
  <span style="color: #fb4933;">where</span> utterances <span style="color: #83a598;">::</span> <span style="color: #d3869b;">ProbProg</span> (<span style="color: #d3869b;">Expr</span> <span style="color: #d3869b;">S</span>)
        utterances <span style="color: #83a598;">=</span> categorical [0.33, 0.33, 0.33] [ everyoneSleeps
                                                    , someoneSleeps
                                                    , noOneSleeps ]
        categorical <span style="color: #83a598;">::</span> [<span style="color: #d3869b;">Double</span>] <span style="color: #83a598;">-&gt;</span> [a] <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">ProbProg</span> a
        categorical ws vs <span style="color: #83a598;">=</span> <span style="color: #d3869b;">PP</span> (<span style="color: #83a598;">\</span>f <span style="color: #83a598;">-&gt;</span> sum (zipWith (<span style="color: #83a598;">*</span>) ws (map f vs)))
</pre>
</div>
<p>
<code>Context</code> can be interpreted the same way <code>WorldKnowedge</code> was in <a href="../dec6/dec6.html">the last set of
notes</a>.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">Context</span> <span style="color: #83a598;">=</span> worldKnowledge
</pre>
</div>

<p>
Finally, let's interpret the constants that extract density functions from
probabilistic programs.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">DensityI</span> <span style="color: #83a598;">=</span> <span style="color: #83a598;">\</span>m i <span style="color: #83a598;">-&gt;</span> expVal m (indicator <span style="color: #83a598;">.</span> (mutualEntails 11 i))
  <span style="color: #fb4933;">where</span> mutualEntails <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Int</span> <span style="color: #83a598;">-&gt;</span> [<span style="color: #d3869b;">FOL.Form</span>] <span style="color: #83a598;">-&gt;</span> [<span style="color: #d3869b;">FOL.Form</span>] <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Bool</span>
        mutualEntails n fs1 fs2 <span style="color: #83a598;">=</span> all (entails n fs1) fs2 <span style="color: #83a598;">&amp;&amp;</span> all (entails n fs2) fs1

<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">DensityU</span> <span style="color: #83a598;">=</span> <span style="color: #83a598;">\</span>m u <span style="color: #83a598;">-&gt;</span> expVal m (indicator <span style="color: #83a598;">.</span> (<span style="color: #83a598;">==</span> u))
</pre>
</div>
<p>
In words, <code>DensityI</code> is interpreted as a function, of type <code>ProbProg [FOL.Form]
   -&gt; [FOL.Form] -&gt; Double</code>; that is, which reads in a probabilistic program of
type <code>ProbProg [FOL.Form]</code> and a possible world <code>i</code> (of type <code>[FOL.Form]</code>), in
order to take the probability that the program returns a possible world which
is in a mutual entailment relationship with <code>i</code>.
</p>

<p>
The interpretation of <code>DensityU</code>, which is of type <code>ProbProg (Expr S) -&gt; Expr S
   -&gt; Double</code>, is similar; but it rather takes the probability that the relevant
program returns the relevant input utterance <code>u</code>. 
</p>

<p>
That's it! If we want to test this out, we could, say, check the mass that <code>l
   1</code> assigns to some example possible world <code>i0</code>, when it is applied to the
utterance <code>someoneSleeps</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #928374;">-- </span><span style="color: #928374;">An example possible world</span>
<span style="color: #fabd2f;">i0</span> <span style="color: #83a598;">::</span> [<span style="color: #d3869b;">FOL.Form</span>]
<span style="color: #fabd2f;">i0</span> <span style="color: #83a598;">=</span> [sleep (<span style="color: #d3869b;">FOL.N</span> (<span style="color: #d3869b;">FOL.Name</span> 1)), <span style="color: #d3869b;">FOL.Not</span> (sleep (<span style="color: #d3869b;">FOL.N</span> (<span style="color: #d3869b;">FOL.Name</span> 0)))]
</pre>
</div>
<p>
(<code>i0</code> is the world where Julian (<code>FOL.N (FOL.Name 1)</code>) sleeps but Carina (<code>FOL.N
   (FOL.Name 0)</code>) doesn't.)
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #83a598;">&gt;&gt;&gt;</span>  interpClosedTerm (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">DensityI</span>) (<span style="color: #d3869b;">App</span> (l 1) (<span style="color: #d3869b;">Con</span> (<span style="color: #d3869b;">ToUtt</span> someoneSleeps)))) i0
0.49696969696969695
</pre>
</div>
<p>
Thus when the relevant utterance is <i>someone sleeps</i>, \(L_1\) assigns about half
the mass to the possible world in which one person sleeps and the other
person doesn't. Indeed, close to all of the remaining mass will be assigned
to the possible world in which the sleepers are switched; that is, in which
Carina sleeps, but Julian doesn't. Close to no mass at all is assigned to the
possible world in which both Julian and Carina sleep. Hence, we end up with
something like a <i>quantity implicature</i>, due to the choice of a prior over
utterances which includes the utterance <i>everyone sleeps</i>.
</p>

<p>
You can check that the difference between the \(L_0\) model and the \(L_1\) model
is effectively the presence of this implicature; the \(L_0\) model just spits
out the mass assigned by the prior probability over worlds to worlds in which
at least one person sleeps, consistent with the literal meaning of the
quantifier <i>some</i>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Julian Grove</p>
<p class="date">Created: 2023-12-18 Mon 12:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
